R/background/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
	(0 -2 0)     //0
	(4.5 -2 0)   //1
	(4.5 2 0)    //2
	(0 2 0)      //3
	(0 -2 1.35)  //4
	(4.5 -2 1.35)//5
	(4.5 2 1.35) //6
	(0 2 1.35)   //7
);



blocks
(
	hex (0 1 2 3 4 5 6 7) (112 103 48)
	simpleGrading
	(
		(
			(0.5 0.335 1 )
			(0.056 0.054 0.33)
			(0.22 0.45 1)
			(0.056 0.054 3)
			(0.167 0.11 1)
		)
		(
			(0.312 0.204 1)
			(0.063 0.058 0.33)
			(0.25 0.485 1)
			(0.063 0.058 3)
			(0.312 0.204 1)
		)
		(
			(0.31 0.147 1)
			(0.096 0.063 0.33)
			(0.519 0.737 1)
			(0.074 0.0526 3)			
		)
		
	)
);

edges
(
);

boundary
(

    oversetPatch
    {
        type overset;
        faces ();
   }

    inlet
    {
        type patch;
        faces
        (
			(0	4	7	3)
			
        );
    }
	
    outlet
    {
        type patch;
        faces
        (
			(1 2 6 5)
        );
    }
	
    ground
    {
        type wall;
        faces
        (
			(0	3	2	1)
			

        );
    }
	
	
    walls
    {
        type patch;
        faces
        (
			(0 1 5 4)
			(2 3 7 6)
        );
    }
	
    atmosphere
    {
        type patch;
        faces
        (
			(4 5 6 7)
			
        );
    }

    floatingObject
    {
        type wall;
        faces ();
    }
);

// ************************************************************************* //
