R/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   100;	
    outerDistance   101;	

    centreOfMass    (3 0 0.7983);

    		
		
    // Density of the solid
    rhoSolid        425;

    // Cylinder mass
    mass       35.5     ;	
	
    //moment of inertia about the centre of mass

    momentOfInertia (0.87 0.87 1.17);
	
    report          on;
	reportToFile    on;
    accelerationRelaxation 	0.95;
    accelerationDamping 	1.00;
	


    solver
    {
        type Newmark;
    }

    constraints
    {
        fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            direction (0 0 1);
        }
		
    }
}


// ************************************************************************* //
